'''
Туристические агентства предлагают следующие туры. Вояж – Мексика,Канада,Израиль, 
Италия,США. РейнаТур – Англия,Япония,Канада,ЮАР. Радуга – США,Испания,Швеция, 
Австралия.  
Определить в каких турагенствах можно приобрести туры в Канаду, а в каких в США
'''

tours = {
    'Вояж': ['Мексика', 'Канада', 'Израиль', 'Италия', 'США'],
    'РейнаТур': ['Англия', 'Япония', 'Канада', 'ЮАР'],
    'Радуга': ['США', 'Испания', 'Швеция', 'Австралия'],
}

canada_agencies = [agency for agency, countries in tours.items() if 'Канада' in countries]
usa_agencies = [agency for agency, countries in tours.items() if 'США' in countries]

print(f'В Канаду: {', '.join(canada_agencies)}')
print(f'В США: {', '.join(usa_agencies)}')